Revit 2027 API
DocumentChangedEventArgs.GetAddedElementIds(ElementFilter) Method
 Returns set of newly added elements that pass the filter.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ICollection<ElementId> GetAddedElementIds(
	ElementFilter filter
)
Public Function GetAddedElementIds (
	filter As ElementFilter
) As ICollection(Of ElementId)
public:
ICollection<ElementId^>^ GetAddedElementIds(
	ElementFilter^ filter
)
member GetAddedElementIds :
        filter : ElementFilter -> ICollection<ElementId>
Parameters
filter ElementFilter
 The element filter to be applied.
Return Value
ICollection<ElementId>
 The set of ElementId for newly added elements that pass the filter. Returns empty set if no elements are found which pass the filter.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
DocumentChangedEventArgs Class
GetAddedElementIds Overload
Autodesk.Revit.DB.Events Namespace